<template>
  <div id="iconTechnicalSupport" :style="{width: size+'px', height:size+'px'}" @mouseover="inColor"
       @mouseleave="outColor">
    <svg :width="size" :height="size" :viewBox="viewBox" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path d="M20.5714 8.59286C20.5714 3.83571 16.7357 0 12 0C7.26429 0 3.42857 3.83571 3.42857 8.57143C3.42857 8.57143 3.42857 8.57143 3.42857 8.59286C1.52143 8.7 0 10.2857 0 12.2143V12.6429C0 14.6571 1.62857 16.2857 3.64286 16.2857H3.83571L5.35714 18.7071C6.42857 20.4214 8.25 21.4286 10.2643 21.4286H10.5643C10.7571 22.1571 11.4214 22.7143 12.2143 22.7143C13.1571 22.7143 13.9286 21.9429 13.9286 21C13.9286 20.0571 13.1571 19.2857 12.2143 19.2857C11.4214 19.2857 10.7571 19.8429 10.5643 20.5714H10.2643C8.55 20.5714 6.98571 19.6929 6.08571 18.2357L4.84286 16.2857H5.14286C5.61429 16.2857 6 15.9 6 15.4286V9.42857C6 8.95714 5.61429 8.57143 5.14286 8.57143H4.28571C4.28571 4.30714 7.73571 0.857143 12 0.857143C16.2643 0.857143 19.7143 4.30714 19.7143 8.57143H18.8571C18.3857 8.57143 18 8.95714 18 9.42857V15.4286C18 15.9 18.3857 16.2857 18.8571 16.2857H20.3571C22.3714 16.2857 24 14.6571 24 12.6429V12.2143C24 10.2857 22.4786 8.7 20.5714 8.59286ZM12.2143 20.1429C12.6857 20.1429 13.0714 20.5286 13.0714 21C13.0714 21.4714 12.6857 21.8571 12.2143 21.8571C11.7429 21.8571 11.3571 21.4714 11.3571 21C11.3571 20.5286 11.7429 20.1429 12.2143 20.1429ZM5.14286 9.42857V15.4286H3.64286C2.1 15.4286 0.857143 14.1857 0.857143 12.6429V12.2143C0.857143 10.6714 2.1 9.42857 3.64286 9.42857H5.14286ZM23.1429 12.6429C23.1429 14.1857 21.9 15.4286 20.3571 15.4286H18.8571V9.42857H20.3571C21.9 9.42857 23.1429 10.6714 23.1429 12.2143V12.6429Z" :fill="color"/>
    </svg>
  </div>
</template>

<script>
    export default {
        /**
         * КОМПОНЕНТ ИКОНИ ДОМОЙ
         * @param:
         *        size      - размер иконки
         *        color     - цвет иконки
         *
         * ПРИМЕР ВЫЗОВА ИКОНКИ
         *                      <div class="icon" style="width: 100%; height: 50px;">
         *                             <icon-navigation-home :color="'red'"/>
         *                       </div>
         */
        name: "iconTechnicalSupport",
        props: {
            size: {
                type: Number,
                default: 24
            },
            color: {
                type: String,
                default: '#909090'
            },
            viewBox: {
                type: String,
                default: "0,0,24,23"
            }
        },
        data() {
            return {
                colorIcon: '#909090',
                testBool: false
            }
        },
        methods: {
            inColor() {
                this.colorIcon = '#4A90E2';
            },
            outColor() {
                this.colorIcon = this.color;
            }
        },
        mounted() {
            this.colorIcon = this.color;
        }
    }
</script>

<style lang="less">
  #iconTechnicalSupport {
    position: relative;

    > svg {
      position: absolute;
    }
  }
</style>






