const info = {
        title: 'Блок какой то с инфой',
        data: [
            {
                img: '../../../static/image/fonNews.png',
                info: 'В мире набирают популярность здоровый образ жизни и правильное питание. Всё больше людей выбирают качественные и проверенные продукты, изучают состав и включают в свой рацион продукты на растительной основе.',
                title: 'Блок 1',
                url: '123123123'
            },
            {
                img: '../../../static/image/overlay.png',
                info: 'В мире набирают популярность здоровый образ жизни и правильное питание. ',
                title: 'Блок 2',
                url: '123123123'
            },
            {
                img: '../../../static/image//Backgraund.png',
                info: 'В мире набирают популярность здоровый образ жизни и правильное питание.',
                title: 'Блок 3',
                url: '123123123'
            },
            {
                img: '../../../static/image/fonNews.png',
                info: 'В мире набирают популярность здоровый образ жизни и правильное питание.',
                title: 'Блок 4',
                url: '123123123'
            },
            {
                img: '../../../static/image/Backgraund.png',
                info: 'В мире набирают популярность здоровый образ жизни и правильное питание. Всё больше людей выбирают качественные и проверенные продукты, изучают состав и включают в свой рацион продукты на растительной основе. Напитки и десерты из растительных ингредиентов отлично подойдут тем, кто придерживается поста.',
                title: 'Блок 5',
                url: '123123123'
            },
        ]
};

module.exports = {
    dataSlider: info
}